# 데이터프레임 생성
- 딕셔너리 + 리스트 => 데이터프레임
- 딕셔너리 + 딕셔너리
- 2차원 리스트 
- 2차원 넘파이배열 => 데이터프레임 
- 2개이상의 시리즈 => 데이터프레임 

```
pd.DataFrame(데이터, columns = 컬럼명리스트, index = 인덱스의 리스트 )
```

In [26]:
import numpy as np
import pandas as pd

## 2차원 리스트 => 데이터프레임

In [27]:
data = [['Elise', 1.5, 2014], ['Julia', 1.7, 2015],
        ['Jhon', 3.6, 2016], ['Charles', 2.5, 2017],['Charles', 2.9, 2018]]

df1 = pd.DataFrame(data, columns = ['name', 'score', 'year'], index = range(10, 51, 10))
df1

       name  score  year
10    Elise    1.5  2014
20    Julia    1.7  2015
30     Jhon    3.6  2016
40  Charles    2.5  2017
50  Charles    2.9  2018

In [30]:
#컬럼명 변경 
#데이터프레임명.columns = 리스트
#df1.columns = ['Name', 'Score', 'Year']
df1.columns = ['name', 'grade', 'std_id']
df1

       name  grade  std_id
10    Elise    1.5    2014
20    Julia    1.7    2015
30     Jhon    3.6    2016
40  Charles    2.5    2017
50  Charles    2.9    2018

In [31]:
#인덱스명 수정
#데이터프레임명.index = 리스트/range
df1.index = np.arange(100, 501, 100)
df1

        name  grade  std_id
100    Elise    1.5    2014
200    Julia    1.7    2015
300     Jhon    3.6    2016
400  Charles    2.5    2017
500  Charles    2.9    2018

## 2차원 넘파이 배열 ==> 데이터프레임

In [32]:
data = np.random.randint(1, 100, 50).reshape(-1,5)
data

array([[82, 16, 25, 14, 10],
       [90, 12, 23,  2, 82],
       [58, 56, 62, 66, 48],
       [17, 79, 13, 64, 79],
       [70, 60, 98, 89, 12],
       [55, 67, 79, 49,  1],
       [92, 82, 83,  3, 32],
       [52, 44, 82, 52,  1],
       [99, 79, 29, 93, 54],
       [80, 95, 20, 73, 18]])

In [33]:
df2 = pd.DataFrame(data)
df2

    0   1   2   3   4
0  82  16  25  14  10
1  90  12  23   2  82
2  58  56  62  66  48
3  17  79  13  64  79
4  70  60  98  89  12
5  55  67  79  49   1
6  92  82  83   3  32
7  52  44  82  52   1
8  99  79  29  93  54
9  80  95  20  73  18

In [34]:
# 리스트 comprehension
[i for i in range(1,6)]

[1, 2, 3, 4, 5]

In [36]:
df2.columns = ['col' + str(i) for i in range(1,6)] # col에 1부터 6까지의 숫자를 붙여 컬럼명
df2.index = ['row' + str(i) for i in range(1,11)] # row에 1,11까지의 숫자를 붙여 인덱스명
df2

       col1  col2  col3  col4  col5
row1     82    16    25    14    10
row2     90    12    23     2    82
row3     58    56    62    66    48
row4     17    79    13    64    79
row5     70    60    98    89    12
row6     55    67    79    49     1
row7     92    82    83     3    32
row8     52    44    82    52     1
row9     99    79    29    93    54
row10    80    95    20    73    18

## 딕셔너리 리스트 = 데이터프레임

- 딕셔너리 리스트란?
```
딕셔너리의 값이 리스트인 형태
딕셔너리 키가 컬럼명, 딕셔너리 값은 컬럼값
딕셔너리의 값
```

In [38]:
data = {"name":['Elise', 'Julia', 'Jhon', 'Charles', 'Charles'],
        #"year": [2014,2015,2016, 2017, 2018, 2019], #ValueError
        "year":[2014, 2015, 2016, 2017, 2018],
        "points":[1.5, 1.7, 3.6, 2.5, 2.9]}
df3 = pd.DataFrame(data)
df3

      name  year  points
0    Elise  2014     1.5
1    Julia  2015     1.7
2     Jhon  2016     3.6
3  Charles  2017     2.5
4  Charles  2018     2.9

## 이중 딕셔너리(Nested Dictionary) ==> 데이터 프레임

- 이중 딕셔너리? Dictionary의 값이 Dictionary인 형태
- 딕셔너리 키가 컬럼명 - 딕셔너리 값에 있는 딕셔너리의 키는 행 이름으로 적용

In [39]:
data = {'Nevada': {2001:2.4, 2002:2.9},
       'Ohio': {2000: 1.5, 2001:1.7, 2002:3.6},
       'LA': {2003:3.3, 2004:4.3, 2005:4.1}}
df4 = pd.DataFrame(data)
df4

      Nevada  Ohio   LA
2001     2.4   1.7  NaN
2002     2.9   3.6  NaN
2000     NaN   1.5  NaN
2003     NaN   NaN  3.3
2004     NaN   NaN  4.3
2005     NaN   NaN  4.1

## 시리즈의 조합 ==> 데이터프레임

In [40]:
s1 = pd.Series({'a': 'apple', 'b':'banana', 'c': 'cat', 'd':'drama'})
s2 = pd.Series({'a': 'apart', 'b': 'bat', 'c':'cartoon'})
s1

a     apple
b    banana
c       cat
d     drama
dtype: object

In [41]:
df5 = pd.DataFrame([s1, s2])
df5

       a       b        c      d
0  apple  banana      cat  drama
1  apart     bat  cartoon    NaN

# 데이터프레임의 속성
```
데이타프레임의 행 요소 조회 – 데이타프레임이름.index
데이타프레임의 열 요소 조회 – 데이타프레임이름.columns
데이타프레임의 요소 값 조회 – 데이타프레임이름.values
데이타프레임의 전체구조 - 데이타프레임이름.shape
```

In [42]:
df5

       a       b        c      d
0  apple  banana      cat  drama
1  apart     bat  cartoon    NaN

In [43]:
print(df5.index)
print(df1)
print(df1.index)

RangeIndex(start=0, stop=2, step=1)
        name  grade  std_id
100    Elise    1.5    2014
200    Julia    1.7    2015
300     Jhon    3.6    2016
400  Charles    2.5    2017
500  Charles    2.9    2018
Int64Index([100, 200, 300, 400, 500], dtype='int64')

## 인덱스 대표이름과 컬럼 대표이름 지정

In [44]:
df2.index.name = "Num"
df2.columns.name = 'Info'
df2

Info   col1  col2  col3  col4  col5
Num
row1     82    16    25    14    10
row2     90    12    23     2    82
row3     58    56    62    66    48
row4     17    79    13    64    79
row5     70    60    98    89    12
row6     55    67    79    49     1
row7     92    82    83     3    32
row8     52    44    82    52     1
row9     99    79    29    93    54
row10    80    95    20    73    18

## 데이터프레임 정보 확인 
- 전체갯수, 결측치, 구조 , 데이타형태, 통계(편차 사분위, 평균)
- 데이타프레임.describe()
- 데이타프레임.info()
- 데이타프레임.dtypes

In [45]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, row1 to row10
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    10 non-null     int32
 1   col2    10 non-null     int32
 2   col3    10 non-null     int32
 3   col4    10 non-null     int32
 4   col5    10 non-null     int32
dtypes: int32(5)
memory usage: 280.0+ bytes

In [46]:
# 전체갯수, 결측치, 구조 , 데이타형태, 통계(편차 사분위, 평균)
df2.describe()

Info        col1       col2       col3       col4       col5
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean   69.500000  59.000000  51.400000  50.500000  33.700000
std    24.649769  27.852788  32.397531  33.603075  30.590667
min    17.000000  12.000000  13.000000   2.000000   1.000000
25%    55.750000  47.000000  23.500000  22.750000  10.500000
50%    75.000000  63.500000  45.500000  58.000000  25.000000
75%    88.000000  79.000000  81.250000  71.250000  52.500000
max    99.000000  95.000000  98.000000  93.000000  82.000000

In [47]:
#각 컬럼의 데이타형 확인
df2.dtypes

Info
col1    int32
col2    int32
col3    int32
col4    int32
col5    int32
dtype: object

## 데이터프레임 조회
- 컬럼 조회 (데이타프레임은 컬럼 우선)
- 행 조회
- 컬럼 + 행 조회

```
데이타프레임[컬럼명]
데이타프레임[컬럼명1, 컬럼명2, 컬럼명3]

loc: location 행이름, 컬럼명
데이타프레임.loc[행이름]
데이타프레임.loc[start:end]
데이타프레임.loc[start:end, start:end]

iloc: location 행인덱스, 컬럼인덱스
데이타프레임.iloc[행인덱스]
데이타프레임.iloc[start:end]
데이타프레임.iloc[start:end, start:end]

```

In [49]:
data = {"name":["Haidi", "Haidi", "Haidi", "Charles", "Charles"],
        "year":[2014, 2015, 2016, 2015, 2017],
        "points":[1.5, 1.7, 3.6, 2.5, 2.9],
       "penalty" : [1,2,3,4,5]}
df1 = pd.DataFrame(data, columns=["year", "name", "points", 
                                 "penalty"], index=["one", "two", "three", "four", "five"])
df1

       year     name  points  penalty
one    2014    Haidi     1.5        1
two    2015    Haidi     1.7        2
three  2016    Haidi     3.6        3
four   2015  Charles     2.5        4
five   2017  Charles     2.9        5

In [51]:
# 컬럼 조회
df1.columns

Index(['year', 'name', 'points', 'penalty'], dtype='object')

In [52]:
# 인덱스 조회 
df1.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [53]:
#시리즈로 나온다. 왜냐? 한개의 컬럼을 조회했기 때문에
#데이타프레임['컬럼명']
df1['name']

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

In [54]:
type(df1['name'])

pandas.core.series.Series

In [55]:
# 특정1개의 컬럼 조회 => 데이터프레임
# 데이타프레임 [[컬럼명]]
df1[['name']]

          name
one      Haidi
two      Haidi
three    Haidi
four   Charles
five   Charles

In [56]:
# df1['name', 'points']는 안된다. 
df1[['name', 'points']]

          name  points
one      Haidi     1.5
two      Haidi     1.7
three    Haidi     3.6
four   Charles     2.5
five   Charles     2.9

In [58]:
# .을 사용해도 같은 결과
df1.name

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

### loc 방식으로 컬럼 조회
[,]에서 앞자리는 행의 자리, 뒤에는 컬럼명

데이타프레임.loc[:, 컬럼명] => 시리즈

데이타프레임.loc[:, 컬럼명1:컬럼명2] => 데이타프레임

데이타프레임.loc[:, 컬럼명]

In [59]:
df1.loc[:, 'name']

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

In [60]:
#컬럼명으로 접근하는 슬라이싱
df1.loc[:, 'year':'penalty']

       year     name  points  penalty
one    2014    Haidi     1.5        1
two    2015    Haidi     1.7        2
three  2016    Haidi     3.6        3
four   2015  Charles     2.5        4
five   2017  Charles     2.9        5

### iloc 방식으로 컬럼 조회

- 데이타프레임.iloc [:, 컬럼인덱스] => 시리즈

- 데이타프레임.iloc [:, 컬럼인덱스1: 컬럼인덱스2] => 데이타프레임

In [63]:
#특정 컬럼 1개
df1.iloc[:, 0] # iloc는 인덱스를 기준으로 [:,0] 전체행, 인덱스가 0인 컬럼 조회

one      2014
two      2015
three    2016
four     2015
five     2017
Name: year, dtype: int64

In [64]:
# 연속 컬럼 슬라이싱
df.iloc[:, 0:4] #====> iloc[:, 열에 들어갈 때는 n:m-1 이라서 조심하기]

      col1  col2  col3  col4
row1   1.0  10.0   3.0   4.0
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   5.0  14.0  15.0  16.0
row5   5.0  10.0   9.0  10.0

#### loc방식으로 행 조회

- 데이타프레임.loc[인덱스명] => 시리즈
- 데이타프레임.loc[인덱스명, :] => 시리즈
- 데이타프레임.loc[인덱스명1:인덱스명2] => 데이타프레임
- 데이타프레임.loc[[인덱스명1, 인덱스명2 ...],:] => 데이타프레임

In [65]:
#특정행 조회 ==> 시리즈
df1.loc['one']

year        2014
name       Haidi
points       1.5
penalty        1
Name: one, dtype: object

In [66]:
# 특정행 조회 ==> 데이타프레임
df1.loc[['one']]

     year   name  points  penalty
one  2014  Haidi     1.5        1

In [67]:
# 불연속인 행 조회 => two, five
df1.loc[['two', 'five']]

      year     name  points  penalty
two   2015    Haidi     1.7        2
five  2017  Charles     2.9        5

In [68]:
#연속적인 행 조회 => 데이타프레임 슬라이싱
df1.loc['two':'four']

       year     name  points  penalty
two    2015    Haidi     1.7        2
three  2016    Haidi     3.6        3
four   2015  Charles     2.5        4

### iloc 방식으로 행 조회: 위치인덱스 숫자 이용

- 데이타프레임.iloc[행인덱스] => 시리즈
- 데이타프레임.iloc[행인덱스1:행인덱스2] => 데이타프레임

In [69]:
df.iloc[-1]

col1     5.0
col2    10.0
col3     9.0
col4    10.0
Name: row5, dtype: float64

In [73]:
# 1행부터 3행까지 마지막 숫자는 제외
df.iloc[1:4]

      col1  col2  col3  col4
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   5.0  14.0  15.0  16.0

In [74]:
# 첫번째 행부터 끝까지
df.iloc[1:-1]

      col1  col2  col3  col4
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   5.0  14.0  15.0  16.0

In [75]:
# 0,2,4에 맞는 행 출력
df1.iloc[[0,2,4]]

       year     name  points  penalty
one    2014    Haidi     1.5        1
three  2016    Haidi     3.6        3
five   2017  Charles     2.9        5

In [76]:
df1.iloc[[0,2,-1]]

       year     name  points  penalty
one    2014    Haidi     1.5        1
three  2016    Haidi     3.6        3
five   2017  Charles     2.9        5

### 행 조회
```
행 조회 
행의 이름으로는 접근X,
데이타프레임[행인덱스]
데이타프레임[start:end]
특정행의 특정 열 조회 
데이타프레임명.iloc[start1:end1, start2:end2]
데이타프레임명.iloc[인덱스명1:인덱스명2, 컬럼명1 : 컬럼명2]
```

In [77]:
# 인덱스가 two부터 three까지, 컬럼은 year부터 name까지
df1.loc['two':'three', 'year':'name']

       year   name
two    2015  Haidi
three  2016  Haidi

In [78]:
df.iloc[1:3, 0:2]

      col1  col2
row2   5.0   6.0
row3   9.0  10.0